# utility plugins
romkatv/zsh-defer
romkatv/zsh-bench kind:path

# Zephyr
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/completion
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions
mattmc3/zephyr path:plugins/macos

# prompt
romkatv/powerlevel10k

# deferred plugins
olets/zsh-abbr kind:defer
zsh-users/zsh-history-substring-search
zdharma-continuum/fast-syntax-highlighting kind:defer

# Work
ahmetb/kubectx path:completion kind:fpath

# general
zsh-users/zsh-autosuggestions
jeffreytse/zsh-vi-mode
unixorn/fzf-zsh-plugin
qoomon/zsh-lazyload
Freed-Wu/fzf-tab-source
Aloxaf/fzf-tab
