# utility plugins
romkatv/zsh-defer
romkatv/zsh-bench kind:path

# Zephyr
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions
mattmc3/zephyr path:plugins/macos

# prompt
romkatv/powerlevel10k

# general
jeffreytse/zsh-vi-mode
Aloxaf/fzf-tab
unixorn/fzf-zsh-plugin

# completion plugins
# zsh-users/zsh-completions
# mattmc3/zephyr path:plugins/completion
# marlonrichert/zsh-autocomplete

# deferred plugins
olets/zsh-abbr kind:defer
zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search kind:defer

